app/controllers/admin_controller.rb

SELECT COUNT(*) FROM "companies"
SELECT COUNT(*) FROM "entities"
SELECT COUNT(*) FROM "securities"
SELECT COUNT(*) FROM "kinds"
SELECT COUNT(*) FROM "transactions"
---
  def home
    @c_count = Company.count
    @e_count = Entity.count
    @s_count = Security.count
    @k_count = Kind.count
    @t_count = Transaction.count