app/controllers/companies_controller.rb

  def show
    @company = Company.find(params[:id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = 1 LIMIT 1

  def create
    @company = Company.new(params[:company])

    respond_to do |format|
      if @company.save
---
INSERT INTO "companies" ("name", "created_at", "updated_at") VALUES ('bob', '2011-08-20 00:02:08.629229', '2011-08-20 00:02:08.629229')