app/controllers/possessions_controller.rb

SELECT "possessions".* FROM "possessions"
---
  def index
    @possessions = Possession.all