app/controllers/securities_controller.rb

SELECT "securities".* FROM "securities"
---
  def index
    @securities = Security.all

SELECT "kinds".* FROM "kinds"
---
  def new
    @security = Security.new
    @kinds = Kind.all

SELECT "kinds".* FROM "kinds"
---
  def create
    @security = Security.new(params[:security])
    @kinds = Kind.all